Tekla Open API Reference for Tekla Structures 2025
PolymeshEnumerator Class
 The PolymeshEnumerator class is used to enumerate the polymesh of a pour's merged faces.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.PolymeshEnumerator
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PolymeshEnumerator : IEnumerator
Public NotInheritable Class PolymeshEnumerator
	Implements IEnumerator
The PolymeshEnumerator type exposes the following members.
Properties
Name | Description
Current
 Gets the current polymesh.
Top
Methods
Name | Description
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
Tekla.Structures.Model Namespace